# Лабораторная работа №3
# Задание 3.1
#Метод: простая итерация , метод Зейделя

import math

# Начальные приближения (можно выбрать, например, нули)
x = [0.0, 0.0, 0.0, 0.0]

# Точность
epsilon = 0.001

# Максимальное число итераций, чтобы избежать бесконечного цикла
max_iterations = 1000

for iteration in range(max_iterations):
    x_prev = x.copy()

    # Обновляем каждую переменную по формуле
    x[0] = -1.2 + 0.17 * x_prev[1] - 0.31 * x_prev[2] + 0.16 * x_prev[3]
    x[1] = 0.38 + 0.18 * x_prev[1] + 0.43 * x_prev[2] - 0.08 * x_prev[3]
    x[2] = 0.48 + 0.22 * x_prev[0] + 0.18 * x_prev[1] + 0.25 * x_prev[2] + 0.07 * x_prev[3]
    x[3] = -1.24 + 0.08 * x_prev[0] + 0.07 * x_prev[1] + 0.71 * x_prev[2] + 0.04 * x_prev[3]

    # Проверка сходимости
    if max(abs(x[i] - x_prev[i]) for i in range(4)) < epsilon:
        break

# Вывод результата
print(f"Решение после {iteration+1} итераций:")
print(f"x1 = {x[0]:.4f}")
print(f"x2 = {x[1]:.4f}")
print(f"x3 = {x[2]:.4f}")
print(f"x4 = {x[3]:.4f}")


#22222222
# Задание 2: Решение системы методом Зейделя с точностью epsilon=0.001

# Начальные приближения
x = [0.0, 0.0, 0.0]

# Точность
epsilon = 0.001

# Максимальное число итераций
max_iterations = 1000

for iteration in range(max_iterations):
    x_prev = x.copy()

    # Обновление по формулам (метод Зейделя), использую уже обновленные значения
    # Вычисляем x_1
    x[0] = (2.4 + 2.3 * x[1] - 4.5 * x[2]) / 3.7

    # Вычисляем x_2
    x[1] = (3.5 - 2.5 * x[0] + 7.8 * x[2]) / 4.7

    # Вычисляем x_3
    x[2] = (-2.4 - 1.6 * x[0] - 5.3 * x[1]) / 1.3

    # Проверка сходимости
    if max(abs(x[i] - x_prev[i]) for i in range(3)) < epsilon:
        break

# Вывод результата
print(f"Метод Зейделя победил за {iteration+1} итераций.")
print(f"x1 = {x[0]:.4f}")
print(f"x2 = {x[1]:.4f}")
print(f"x3 = {x[2]:.4f}")
